{
  "greet1": "Hi, there!",
  "greet2": "I'm Seung-yun, ",
  "greet3": "a newcomer FE Developer ",
  "greet4": "who like doing study.",
  "error1": "You can see when your device is PC browser",
  "error2": "Please resize your browser height.",
  "stack1": "Seung-yun Shin",
  "stack2": "1988",
  "stack3": "Seoul Dongdaemun",
  "intro1": "A Growing ",
  "intro2": "Developer",
  "intro3": "A Developer who has studied not only foreign languages but also computer languages",

  "intro5": "Looking for answers until problems will be solved",
  "intro6": "Once I started, do my best not to give up until I achieve it",
  "keyword1": "tenacity",
  "keyword2": "heavy butt",
  "keyword3": "concentration",
  "keyword4": "from scratch",
  "keyword5": "learning languages",
  "goal": "Next Goals",
  "which": "Government Support",
  "subject": "Smart Web & Contents Development",
  "subject1": "Web Contents ",
  "subject2": "Design & Front End ",
  "provider": " Night Computer class",
  "check": "Class Certificate",
  "detail": "To take the practical exam in 2023",
  "title1": "Samsung EM",
  "title2": "LocknLock(KR)",
  "title3": "Momentum",
  "title4": "KakaoTalk",
  "title5": "COMMING SOON",
  "title6": "My Portfolio",
  "th_title": "Used",
  "th_title1": "Note",
  "th_title2": "Test",
  "th_title3": "Headcount",
  "th_title4": "Device",
  "td_detail2": "One-man",
  "td_detail3": "Team",
  "td_detail4": "Responsive",
  "td_detail5": "Non-responsive",
  "td_detail6": "Install",
  "td_detail7": "/assets/images/q-net_certification_en.jpg",
  "btn_detail": "Detail",
  "pop1_explain1": "This is first work piece of Clone company websites.",
  "pop1_explain2": "All pages are non-responsive design, only the header and footer areas of the same design in each page file are separated into diffrent files, so those are printed on the the index and subpages samely by using jQuery.",
  "pop1_explain3": "I used a mix of pure javascript ES5 and ES6 to implement other functions (like const, let with function mixin).",
  "pop1_explain4": "Pages design is based on the company's site identified by May 2022.",
  "pop2_explain1": "This is second work piece of Clone company websites.",
  "pop2_explain2": "Sub pages are designed non-responsive but Index page is responsive design. Element functions were created with pure javascript, and Slide is activating by push the buttons.",
  "pop2_explain3": "Pages design is based on the company's site identified by from the end of 2021 to January 2022.",
  "pop2_explain4": "2022.11 - For review, only Slide.js has been modified to ES6.",
  "pop3_explain1": "It's a To do List. LocalStorage is used for saving user name and list data, so you can continue to use the list when you restart browser and access this page after exit.",
  "pop3_explain2": "Function array and Math.random() are used to choose diffrent background images and wise quotes at the bottom of the page each time you press F5 or restart browser.",
  "pop3_explain3": "You can check selebrity's name who said this wise quotes if you hover the mouse cursor.",
  "pop3_explain4": "Redesign for responsive PC browser Oct. 2022",
  "pop4_explain1": "I used React ver18.0 and ES5 for creating this demo page.",
  "pop4_explain2": "The recurring list is retrieved from JSON's data and uses the HTTP asynchronous communication library Axios using Promise API to synchronize username with a third data link.",
  "pop4_explain3": "",
  "pop4_explain4": "This demo app pages design is borrowed an old design of Korean messanger 'Kakao talk'.",
  "pop5_explain1": "",
  "pop5_explain2": "",
  "pop5_explain3": "",
  "pop5_explain4": "",
  "pop6_explain1": "It's One-paged Portfolio based on React 18 created by myself.",
  "pop6_explain2": "I used localization API i18next for supporting Korean, English and Japanese language and connected some elements animation with browser scroll.",
  "pop6_explain3": "If element's design are same, Using JSON for calling back text and image datas. (Local JSON)",
  "pop6_explain4": "Contact form use API from Emailjs, and mailto href, also My portfolio is support light/dark mode with system setting or personal taste.",
  "thanksto": "If you have any suggestions or questions,",
  "thanksto1": " please contact me.",
  "rights": "Design and built for Personal Use",
  "notice": "by Seung-yun Shin in 2022"
}
